public class Lesson2Task6 {
    /*
    Задача 3:
Составьте программу, выводящую на экран квадраты чисел от 10 до 20
включительно.
     */
    public static void main(String[] args) {
        for(int i = 10; i <21; i++) {
            System.out.println(i * i);
        }
    }
}
