public class Task_3 {
    /*
    Задача 1:
Написать приложение, которое будет вычислять и выводить значение по
формуле: a=4*(b+c-1)/2;
b и c задаем в коде самостоятельно.
     */
    public static void main(String[] args) {
        int a, b, c;
        b = 5;
        c = 2;

        a = 4 * (b + c - 1) / 2;

        System.out.println(a);
    }
}
