public class Task_7 {
    /*
    Задача 5:
В переменных q и w хранятся два натуральных числа. Создайте программу,
выводящую на экран результат деления q на w с остатком. Пример вывода
программы (для случая, когда в q хранится 21, а в w хранится 8):
21 / 8 = 2 и 5 в остатке.
     */
    public static void main(String[] args) {
        double q, w;
        q = 5;
        w = 2;
        double result = q / w;
        System.out.println(result);
    }
}
