public class Task_1 {
    /*
    Задача 1:
Создать программу, которая будет выводить в консоли Ваше имя и фамилию.
     */
    public static void main(String[] args) {
        String name = "Kirill";
        String lastName = "Semigin";

        System.out.println(name + ' ' + lastName);
    }
}
